Revit 2024 API
MacroModule.MacroManager Property
 The Macro manager.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public MacroManager MacroManager { get; }
Visual Basic
Public ReadOnly Property MacroManager As MacroManager
	Get
Visual C++
public:
property MacroManager^ MacroManager {
	MacroManager^ get ();
}
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace